[
  {
    "album": "Ctrl",
    "lyrics_title": "Prom",
    "lyrics": "Fearin' not growin' up (Growin')\nKeepin' me up at night (At night)\nAm I doin' enough? (Enough)\nFeel like I'm wastin' time, oh, yeah\nPromise to get a little better as I get older\nAnd you're so patient, you're sick of waitin'\nPromise to do better\nShould've, could've, probably wanna let me go\nBut you can't, oh\nRight now, I feel it pourin', I need a little bit\nJust a little bit, just a little bit\nRight now, I feel it pourin', I need a little bit\nJust a little bit, just a little bit\nPlease don't take, don't take it personal\nLike I know you usually do\nPlease don't take, don't take it personal\nLike I know you usually do\nPlease, please\nDon't take it personal\nDarling, like I know you will, ooh\nSee SZA LiveGet tickets as low as $151You might also like\nForget to call your mama on the weekend\nYou should put yourself in time out\n(Sh-sh-shame, sh-sh-shame on you)\nBut lately you've been feelin' so good\nI forget my future, never pull out\n(Sh-sh-shame, Sh-sh-shame on me)\nBaby, the money'll make it easier for me\nTo run and hide out somewhere\n(So far away)\nHoppin' through poppy fields\nDodgin' evil witches\nThese houses keep droppin' everywhere\nPromise to get a little better as I get older\nAnd you're so patient, you're sick of waitin'\nPromise to do better\nShould've, could've, probably wanna let me go\nBut you can't, oh\nRight now, I feel it pourin', I need a little bit\nJust a little bit, just a little bit\nRight now, it's really pourin', I need a little bit\nJust a little bit, just a little bit\nPlease don't take, don't take it personal\nLike I know you usually do\nPlease don't take, take it personal (Please don't take it)\nLike winter's fall on us, heavy\nTake it off me, oh, it hurts\nRainin', I can't stand this\nSnow is fallin' on me, oh, it hurts38Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Go Gina",
    "lyrics": "Hey, love\nYeah, I lost you, babe\nPickin' up a penny with a press-on is\nEasier than holding you down\nCan't be any harder than holding you up now\nTo come clean I said, to be real is (To come clean is to come clean)\nTo be real, it's\nProbably true what they say about me\nProbably came from my inner circle\nIt usually come from your inner circle\nOr lack thereof and I don't know who I can trust\nI've been droppin' out and\nI've been hangin' out with my high friends\nAnd we too stoned to pay attention now\n(Much too cool for seventh grade)\nI mean really, it's same me, it's old me\nYou know? Same shit\nI've been on the low-key grinding\n(Grinding, grinding, grinding, grinding, grinding)\nLearning on the low-key, shining\nTryin' to keep to myself\nBut you bring me out of character\nEvery time again\nDamn, Gina, damn, Gina\nThem jeans, they must be uptight, mama\nYou need some get right, mama\nGo, Gina, go, Gina (Still works for me, it works for me, no)\nGo get that get right, mama (It works for me, it works for me, no)\nGo, Gina, go, Gina (Still works for me, it works for me, no)\nGo 'til you get right, mama (It works for me, it works for me, no)\nSee SZA LiveGet tickets as low as $151You might also like\nI belong to nobody, hope it don't bother you\nYou could mind your business\nI belong to nobody, try not to disturb or\nMind my business\nStill works for me, it works for me, no\nIt works for me, it works for me, no (Go, Gina, go, Gina)\nStill works for me, it works for me, no\nIt works for me, it works for me, no (Go, Gina, go, Gina)\nStill works for me, it works for me, no\nIt works for me, it works for me, no (Go, Gina, go, Gina)\nStill works for me, it works for me, no\nIt works for me, it works for me, no (Go, Gina, go, Gina)\n29Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Broken Clocks",
    "lyrics": "Run fast from my day job\nRunnin' fast from the way it was\nJump quick to a paycheck\nRunnin' back to the strip club\nI'm never goin' back, never goin' back\nNo, you can't make me\nNever goin' back, never goin' back (Nah)\nThey'll never take me\nI've paid enough of petty dues\nI've heard enough of shitty news\nI've had a thing for dirty shoes since I was ten\nLove dirty men alike\nOoh\nBetter day than yesterday (Keep cuttin' up)\nOoh\nI just take it day by day\nOoh, oh\nNever hearing what they say (Uh)\nOoh-ooh (Mm)\nI just do it my way\nAll I got is these broken clocks\nI ain't got no time\nJust burnin' daylight\nStill love, and it's still love, and it's still love\nIt's still love, still love (Still love), still love\nIt's still love, it's still love\nNothin' but love for you (Nothin' but)\nNothin' but love (Nothin' but)\nNothin' but love\nSee SZA LiveGet tickets as low as $151You might also like\nAll that I've got, pieces and pages\nTalkin' a lot, sorry, I'm faded (Turnin' up real good tonight)\nThink I forgot you love me (Think I forgot the other night)\nYou love me, you love me\nGot a shift at 10 AM (Yeah)\nGotta dip at 10 PM (Nah)\nGotta get that cash\nWon't get past a lunch break\nI ain't had a smoke break\nIn about two days, don't break (Ugh)\nBeen about three years since I dated you\nWhy you still talkin' 'bout me like we together?\nI moved on for the better, you moved on to whoever\nI was down for whatever and then some\nYou gon' make me late to work again\nOoh\nBetter day than yesterday\nOoh\nI just take it day by day\nOoh, oh\nNever hearing what they say\nOoh-ooh\nI just do it my way (Keep doin' it)\nAll I got is these broken clocks\nI ain't got no time\nJust burnin' daylight\nStill love, and it's still love, and it's still love\nIt's still love, still love, still love (Still love)\nIt's still love, and it's still love (Still love)\nNothin' but love for you\nNothin' but love (Nothin' but)\nNothin' but love\nI don't eat, can't sleep past 9 AM\nHeartbeat make me feel young again (Make me feel like a—)\nCan't beat 'em, just join the party (Let me join the party)\nI don't wanna, don't need nobody\nAll that I've got, pieces and pages\nTalkin' a lot, sorry, I'm faded\nThink I forgot you love me\nYou love me, you love me\nYou love me\nYou love me73Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Doves in the Wind",
    "lyrics": "Real niggas do not deserve pussy\nMeaning it's more you see right through walls\nAin't talkin' about pussy\nMeaning you deserve the whole box of chocolates\nCome with me\nForrest Gump had a lot goin' for him\nNever without pussy\nYou know, Jenny almost gave it all up for him\nNever even pushed for the pussy\nWhere's Forrest now when you need him?\nTalk to me, talk to me, hey, ayy, hey\nAttention, all you niggas, all you bitches\nSit back and relax your mind, just ride, just ride\nSit back and relax, you'll find just why, just why (Why)\nSit back, relax, just ease your mind, just ride (Ride, ride, ride)\nYou are now watching MADtv\nNiggas'll lose they mind for it, wine for it, dine for it (Pussy)\nSpend time for it, see no colored line for it (Pussy)\nDouble back, handicap, and go blind for it (Pussy)\nPussy got endless prisoners, pussy always revengin' her\nPussy is calculatin' and good pussy is rather dangerous\nPussy can be so facetious, the heavyweight champ\nPussy is so undefeated, let's amen to that\nI mean, the pump fakes on the Facebooks\nAnd the screw face when the bae look\nWon't get you no pussy\nI mean, the fake chains and the code names\nFor insecure, gon' reassure you not to get pussy (You not to get)\nYou overcompensate too much for the pussy\nYou like to throw all kinda shade for the pussy\nSee, that's what pussy niggas do\nI know the ways of a pussy, I see pussy lookin' at you\nHow many niggas get mistaken for clitoris in a day?\nHow many sentiments you make before runnin' pussy away?\nHow many times she gotta tell you that dick is disposable?\nBut if she fuck a young nigga like me, it's over for you\nSolána, middle fingers up, speak your truth\nSee SZA LiveGet tickets as low as $151You might also like\nYou could never trivialize pussy\nBut a bum nigga like you would try it (Pussy)\nI know what you really 'bout\nHigh-key, your **** is weak buddy (Pussy)\nIt's only replaced by a rubber substitute\nWe ain't feelin' you, oh\nI think I caught a vibe, kinda feel a nigga\nYou could touch the booty if you like, I ain't trippin' on ya\n(Such a nice girl, SZA)\nI'm really tryna crack off on the headboard\nAnd bust it wide open for the right one\nIs you that for me?\n'Cause if you that for me\nLike doves in the wind, hey, hey\nPussy like doves in the wind, hey, hey\nPussy like doves in the wind\nI will make you beg for it (Attention, all you niggas)\nI wanna see you crawl (All you bitches)\nI'll give you all of me and I won't stop, not a little bit\n(Sit back and relax your mind, just ride, just ride)\nMake you beg for it, I wanted to do it all\n(Sit back and relax, you'll find just why, just why)\nUnfortunately, you couldn't get your shit together\n(Sit back, relax, just ease your mind, just ride)\n(Ride, ride, ride)\nYou are now watching MADtv\nWe take things, and my influence so far, and then it's out of my hands. And, you know, while as I said it can be scary, it can also be a little bit comforting. Because I've learned that when I get to that point, and I can acknowledge, \"Okay, Audrey, that's as much as you can do,\" I can actually let it...56Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Drew Barrymore",
    "lyrics": "Go\nWhy is it so hard to accept the party is over?\nYou came with your new friends\nAnd her mom jeans and her new Vans\nAnd she's perfect and I hate it\nOh, so glad you made it, I'm so glad you could come by\nSomebody get the tacos, somebody spark the blunt\nLet's start the Narcos off at episode one\nBring the gin, got the juice, bring the sin, got that too\nWon't you shut up? Know you're my favorite\nAm I\nWarm enough for you outside, baby? Yeah\n(Tell me if it's warm enough here for you)\nIs it warm enough for you inside me, me, me, me?\nWarm enough for you outside, baby, yeah\n(Tell me if it's warm enough here for you)\nWarm enough outside, inside me, me, me, me\nI get so lonely, I forget what I'm worth\nWe get so lonely, we pretend that this works\nI'm so ashamed of myself, think I need therapy-y-y-y\nI'm sorry I'm not more attractive\nI'm sorry I'm not more ladylike\nI'm sorry I don't shave my legs at night\nI'm sorry I'm not your baby mama\nI'm sorry you got karma comin' to you\nCollect your soul, get it right\nSee SZA LiveGet tickets as low as $151You might also like\nWarm enough for you outside, baby? Yeah\n(Tell me if it's warm enough here for you)\nIs it warm enough for you inside me, me, me, me?\nWarm enough for you outside, baby, yeah\n(Tell me if it's warm enough here for you)\nWarm enough outside, inside me, me, me, me\nSorry, I just need to see you, I'm\nSorry I'm so clingy, I don't mean to be a lot\nDo you really wanna love me down like you say you do?\nGive it to me like you say you do?\n'Cause it's hard enough you got to treat me like this\nLonely enough to let you treat me like this\nDo you really love me\nOr just wanna love me down, down, down, down?\nWarm enough for you outside, baby, yeah\n(Tell me if it's warm enough here for you) Outside, baby, yeah\nWarm enough for you inside me, me, me, me (Me, me, me, me, me)\nWarm enough for you outside, baby, yeah\n(Tell me if it's warm enough here for you) Outside, baby, yeah\nWarm enough outside, inside me, me, me, me (Warm enough outside, inside)\nWarm enough outside, inside\nMe, me, me, me, me, me, me\nOh, is it warm enough\nOutside, inside?91Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "20 Something",
    "lyrics": "How you ain't say you was movin' forward?\nHonesty hurts when you're gettin' older\nI gotta say, I'll miss the way you need me, yeah\nWhy you ain't say you was gettin' bored?\nWhy you ain't say I was fallin' short?\nHow you lead me out so far away?\nHow could it be? Twenty-something\nAll alone, still not a thing in my name\nAin't got nothin', runnin' from love, only know fear\nThat's me, Ms. Twenty-Something\nAin't got nothin', runnin' from love\nWish you were here, oh\nStuck in them twenty-somethings, stuck in them twenty-somethings\nGood luck on them twenty-somethings, good luck on them twenty-somethings\nBut God bless these twenty-somethings\n(God bless, oh, God bless, oh, God bless, oh, God bless, oh)\nHopin' my twenty-somethings won't end\nHopin' to keep the rest of my friends\nPrayin' the twenty-somethings don't kill me, don't kill me\nWeird\nTook us so long to separate\nI feel, it's permanent like a riptide, this time\nWaves crashing fast, I try\nThink of the past, please stay\n(How could it be?)\nSee SZA LiveGet tickets as low as $151You might also like\nHow could it be? Twenty-something\nAll alone still, not a phone in my name (Name)\nAin't got nothin', runnin' from love, only know fear\nThat's me, Ms. Twenty-Something\nAin't got nothin', runnin' from love\nWish you were here, oh\nStuck in them twenty-somethings, stuck in them twenty-somethings\nGood luck on them twenty-somethings, good luck on them twenty-somethings\nBut God bless these twenty-somethings\n(God bless, oh, God bless, oh, God bless, oh, God bless, oh)\nHopin' my twenty-somethings won't end\nHopin' to keep the rest of my friends\nPrayin' the twenty-somethings don't kill me, don't kill me\n(God bless, oh, God bless, oh, God bless, oh, God bless, oh)\nAnd if it's an illusion, I don't want to wake up. I'm gonna hang on to it. Because the, the, the alternative is an abyss, it's just a hole, a darkness, a nothingness. Who wants that? You know? So that's what I think about control. And that's my story, and I'm stickin' to it\nThat was beautiful, mommy, that was perfect39Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Love Galore",
    "lyrics": "I need, I need\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\nDone with these niggas, I don't love these niggas\nI dust off these niggas, do it for fun\nDon't take it personal\nPersonally, I'm surprised you called me after the things I said\nSkrrt-skrrt on niggas (Yeah), skrrt up on niggas (True)\nSkrrt down, you actin' like me (Yeah)\nActin' like we wasn't more than a summer fling\nI said farewell, you took it well (True)\nPromise I won't cry over spilled milk (Ooh, no, I won't)\nGive me a paper towel, gimme another Valium\nGive me another hour or two, hour with you\nWhy you bother me when you know you don't want me? (Yeah)\nWhy you bother me when you know you got a woman? (Yeah)\nWhy you hit me when you know you know better? (True)\nKnow you know better (True)\nKnow your crew better than you do\nCall me, lookin' for ya (Yeah), I be lookin' for ya (Yeah)\nGot me lookin' forward to weekends\nWith you, baby, with you, baby\nWith you, baby (True), with you\nWe do whatever we want, go wherever we want\nLove however we want, it don't matter (True)\nYou do whatever I want, get whatever I want\nGet whatever I need, it's about\nSee SZA LiveGet tickets as low as $151You might also like\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\nShould have never gave you my number, I did it with you\nShould have never let you hit it, I split it with you\nI regret it, you gots a fetish\nYou gots a problem, now it's a problem, oh, no\nSkrrt-skrrt on bitches (Yeah)\nI don't know these bitches (Yeah)\nDig dirt on bitches, do it for fun\nDon't take it personal, baby\nLove on my ladies, l-love to my ladies, uh (True)\nDated a few (Straight up)\nWhy you bother me? Why you bother me? Why you bother me? (Why you bother me? Yeah)\nLast time I checked, you were the one that left (The one)\nMe in a wreck (Yeah), me in a mess (Yeah, yeah)\nYou all I rep (Yeah), like my side I rep (Yeah)\nYeah, that's that Mo City, that side that you can't come 'round at night, yeah (It's lit)\nYou like to get me high, you don't want no one beside ya\nYou like when I make fire, you say, \"La Flame, keep makin' fire\" (Ooh)\nLet me cum inside ya, let me plant that seed inside ya (Ooh)\nAss and titties, titties, only thing that stuck with, with me (With me)\nOnly thing that was real, only thing I could feel, you feel me? (Yeah, feel me?)\nSo why you bother me, why you bother me? (With you, baby, with you, baby)\nTryna catch a P.O.V., yeah (With you)\nLove, love, love, love\nLong as we got\nLove, love, love, oh\nLong as we got\n(Love)\nI came to your city, lookin' for lovin' and licky\n'Cause you promised to put it down\nAll up in your city, lookin' for you, uh\nSearchin' for you, like, love\nOnly thing keepin' me from droppin' you right now\nRight now (Love)\nOnly thing keepin' me by your side\nOnly thing keepin' me by your side now\nBut see, Solána, if you don't say somethin', speak up for yourself\nThey think you stupid, you know what I'm sayin'?179Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Pretty Little Birds",
    "lyrics": "You are but a phoenix among feathers\nYou're broken by the waves among the sea\nThey'll let you die, they'll let you wash away\nBut you swim as well as you fly\nPretty little bird, pretty little bird\nYou've hit the window a few times (The window a few times)\nYou're pretty little bird, pretty little bird\nYou still ain't scared of no heights\nWhen the spiral down feels as good as the flight, oh\nWhen hating you feels good for the night\nWhen the morning comes, I hope you're still mine\nWhen the morning comes\nIf the morning comes (I hope you're still mine)\nWhen the morning comes\nWhen the morning comes, I hope you're still mine (If the morning comes)\nWhen the morning comes\nIf the morning comes\nTold you I like gentle giants so you softened up\nAnd you been jackin', beanin', stalkin' just to get to me, love\nI wanna be your golden goose, I wanna shave my legs for you\nI wanna take all of my hair down and let you lay in it\nSpread all of my limbs out and let you lay in it\nSee SZA LiveGet tickets as low as $151You might also like\nPretty little birds, pretty little birds (Pretty little birds)\nDo you mean every word? You mean every word? (Do you mean?)\nPretty little girls, pretty little girls (Pretty, pretty, pretty, pretty, pretty, pretty)\nWe hit the window a few times (The wall, the wall)\nBah-da-dum-bah, but I can't stay\nBut I would lay\nBut I would (Ooh)\nI would\nLately, I feel like I'm robbin' myself\nLike I'm robbin' mines\nDiamond cerebral, peek into your cortex\nBe faithful and free and just play in your vortex\nI see you, 'Lana, you fly by the pound (Pound)\nFly by the ounce (Ounce)\nFly to the south\nDon't mind them bitches that's cleanin' my house\nLord, you can see, Lord\nYou see them heights that they just can't afford\nI see them lights and you made for that shit\nFuck all that cryin', you pray for that shit, but\nMy wings don't spread like they used to\nBut I wanna fly with you\n('Til we hit the heavens)\nBut my wings don't spread like they used to\nBut I wanna fly with you\n('Til we hit the heavens)\n(Thought I'd seen you, darling)26Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Supermodel",
    "lyrics": "That is my greatest fear\nThat if, if I lost control\nOr did not have control, things would just, you know\nI would be fatal\nI'm writing this letter to let you know I'm really leaving\nAnd no, I'm not keeping your shit\nHeard you got some new homies, got some new hobbies\nEven a new ho too\nMaybe she can come help you\nMaybe she can come lick you\nAfter we're done, what's done is done\nI don't want nothing else to do with it\nLet me tell you a secret\nI've been secretly banging your homeboy\nWhy you in Vegas all up on Valentine's Day?\nWhy am I so easy to forget like that?\nIt can't be that easy for you to get like that\nOh, no, she didn't, ooh, yes, I did\nOh, no, she didn't, I'll do it again\nLeave me lonely for prettier women\nYou know I need too much attention for shit like that\nYou know you wrong for shit like that\nI could be your supermodel if you believe\nIf you see it in me, see it in me, see it in me\nI don't see myself\nWhy I can't stay alone just by myself?\nWish I was comfortable just with myself\nBut I need you, but I need you, but I need you\nSee SZA LiveGet tickets as low as $151You might also like\n\"Ooh, just get a load of them, they got chemistry\"\nAll they could say, we like brother and sister\nLook so good together\nBet they fuckin' for real, and they was right\nThat's why I stayed with ya, the, the dick was too good\nIt made me feel good for temporary love\nYou was a temporary lover\nLeave me lonely for prettier women\nYou know I need too much attention for shit like that\nYou know you wrong for shit like that\nI could be your supermodel if you believe\nIf you see it in me, see it in me, see it in me\nI don't see myself\nWhy I can't stay alone just by myself?\nWish I was comfortable just with myself\nBut I need you, but I need you, but I need you93Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "The Weekend",
    "lyrics": "Mood right\nMood\nYou say you got a girl\nYeah, how you want me? How you want me when you got a girl?\nThe feelin' is reckless, of knowin' it's selfish\nAnd knowin' I'm desperate\nGettin' all in your love, fallin' all over love, like\nDo it 'til it hurts less\nHangin' out the back, all up in your lap\nLike, is you comin' home? Is you out with her?\nI don't care long as you here by 10:30, no later than\nDrop them drawers, give me what I want\nMy man is my man, is your man, heard it's her man too\nMy man is my man, is your man, heard that's her man\nTuesday and Wednesday, Thursday and Friday\nI just keep him satisfied through the weekend\nYou like nine to five, I'm the weekend, oh\nMake him lose his mind every weekend\nYou take Wednesday, Thursday, then just send him my way\nThink I got it covered for the weekend\nSee SZA LiveGet tickets as low as $151You might also like\nI gotta say, I'm in the mood for a little bit more of that\nI mean, I'm sayin', what kind of tease is two days?\nI need me at least 'bout four of them, more of them\nMore you on me, on us, just tell me you want me, yeah, Monday\nAnd I'll be at your door, ready to take her place\nReady to give you what you've been missin' on weekdays\nWhat you've been waitin' for\n10:30, no later than, drop them drawers\nI know what you want\nMy man is my man, is your man, heard it's her man too\nMy man is my man, is your man, heard that's her man\nTuesday and Wednesday, Thursday and Friday\nI just keep him satisfied through the weekend\nYou like nine to five, I'm the weekend, oh\nMake him lose his mind every weekend\nYou take Wednesday, Thursday (Don't worry 'bout none)\nThen just send him my way (Don't worry 'bout none)\nThink I got it covered for the weekend\nAyy\nBright ideas, we got bright ideas\nAyy (Ooh)\nBright ideas, we got bright ideas\nAyy (Ooh)\nBright ideas, we got bright ideas101Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Wavy (Interlude)",
    "lyrics": "I think I'm bad as hell, I got issues, out of line\nSayin' tomorrow I'll do the dishes, never come\nEasy bake, easy wake, oven\nJust give as much as you take\nForgive as much as you hate\nOr get the fuck out\nI've been in the dugout (Dugout)\nLookin' for a way out (Way out)\nYou know, just takin' it slow (Oh, yeah, yeah, yeah)\nNow I'm feelin' worn out (Worn out)\nLookin' for a way out (Way out)\nSomebody show me the door (Oh, yeah, yeah, yeah)\nI was wavy\nI've been waitin' for you, boy\nAnd I was drownin' (Ooh)\nI went crazy\nI've been goin' crazy, boy\nAnd I found out, this the way out (Ooh)\nNow I'm wavy\nSee SZA LiveGet tickets as low as $151You might also like\nYou know, just takin' it slow, babe (Yeah, yeah, yeah)\nSomebody show me the door, babe (Oh, yeah, yeah, yeah)\nYou know, just takin' it slow, babe\nSomebody show me the ropes, babe15Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Normal Girl",
    "lyrics": "Uh, you love the way I pop my top or how I lose my cool\nOr how I look at you\nSay, why?\nIt ain't no fightin', no, I can't stop it\nThis took a while (Yeah)\nLove the way I pump my fist or how I bust my hip\nFor your affection, tryna be down\nNo fightin' and no stoppin'\nStick around\nWish I was the type of girl that you take over to mama\nThe type of girl, I know my daddy, he'd be proud of (Yeah)\nBe proud of (Yeah)\nBe proud of, be proud, you know, you know\nWanna be the type of girl you take home to your mama\nThe type of girl, I know your fellas, they'd be proud of\nBe proud of, be proud of, be proud of, boy, you know\nNormal girl, oh\nI wish I was a normal girl, oh, my\nHow do I be, how do I be your baby?\nNormal girl, oh\nI wish I was a normal girl\nI'll never be, no, never be a, oh\nSee SZA LiveGet tickets as low as $151You might also like\nYou like it (You like it), when I be (When I be), aggressive (Aggre—)\nYou like when I say to you\n\"Get it if you got it, I'm ready and waitin' for it\nI'm callin' to put it on,\" yeah\nLike it (Like it), when I be (When I be), aggressive\nLove when I say to you\n\"Get it if you want it, I'm waitin', I'm gonna find you\nI'm ready to put it on you,\" yeah, yeah\nType of girl you wanna take home to mama\nWanna be the type of girl, my daddy, he'd be proud of\nBe proud of, be proud of, be proud, you know, you know\nThe type of girl you wanna take her home right up to mama\nThe kind of girl, I know your fellas, they'd be proud of\nI'll be probably, I'll be proud like, I'll be probably a problem\nNormal girl, oh, ah\n(No magazine, no fantasy)\nI really wish I was a normal girl\nHow do I be, how do I be your baby?\nNormal girl, oh\nI wish I was a normal girl, oh, babe\nI'll never be, no, never be a, oh\nThis time next year, I'll be livin' so good\nWon't remember your name, I swear\nLivin' so good, livin' so good, livin' so good\nThis time next year, I'll be livin' so good\nWon't remember no pain, I swear\nBefore that you figured out that I was just a normal girl\nNormal girl, what do you say now?\nQuit on the world 'cause it ain't going your way now\nQuit on yourself 'cause you can't figure your way out\nNormal girl\nHow do you be?62Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Anything",
    "lyrics": "Maybe I should kill my inhibition\nMaybe I'll be perfect in a new dimension\nMaybe I should pray a little harder\nOr work a little smarter\nThis time, baby, promise I have learned my lesson, ooh\nDown for the ride, down for the ride\nYou could take me anywhere\nDo-do-down for the ride, down for the ride\nYou could take me anywhere\nI hope you will, I hope you will, I hope you will\nKeepin' up is hard to do\nEven harder feeling heavy, steady chasin' you\nBeep-beep, why are you lookin' around? You lonely?\nI feel you comin' down like money\nDo, do you even know I'm alive?\nDo, do you even know I, I—\nMaybe I should pray a little harder\nOr work a little smarter\nThis time, baby, promise I have learned my lesson, ooh\nSee SZA LiveGet tickets as low as $151You might also like\nDown for the ride, down for the ride\nYou could take me anywhere\nDo-do-down for the ride, down for the ride\nYou could take me anywhere\nI hope you will, I hope you will, I hope you will\nDo, do you even know I'm alive?\nDo, do you even know I, I—\nDo, do you even know I'm alive?\nDo, do you even know I, I—\nDo, do you even know I'm alive?\nDo, do you even know I, I—\nDo, do you even know I'm alive?\nDo, do you even know I, I—\nDo, do you even know I'm alive?\nDo, do you even know I, I—\nDo, do you even know I'm alive?\nDo, do you even know I, I—\nDo you know I'm alive?\nDo, do you even know?24Embed"
  },
  {
    "album": "Ctrl",
    "lyrics_title": "Garden (Say It Like Dat)",
    "lyrics": "Need you for the old me, need you for my sanity\nNeed you to remind me where I come from\nCan you remind me of my gravity?\nGround me when I'm tumblin', spiralin', plummetin' down to Earth\nYou keep me down to Earth\nCall me on my bullshit\nLie to me and say my booty gettin' bigger even if it ain't\nLove me even if it rain\nLove me even if it pain you\nI know I be difficult (Right)\nYou know I be difficult (Right)\nYou know it get difficult to\nOpen your heart up\nHopin' I'll never find out that you're anyone else\n'Cause I love you just how you are\nAnd hope you never find out who I really am\n'Cause you'll never love me, you'll never love me\nYou'll never love me, but I\nBelieve you when you say it like that (Say it like that)\nOh, do you mean it when you say it like that? (Say it like that)\nOh, I believe you when you say it like that (Say it like that)\nYou must really love me\nSee SZA LiveGet tickets as low as $151You might also like\nFor real, I'm not playing no games\nBoy, we're back and forth\nI need your support now (Now, now, now, now, now)\nIn case you call my phone one more 'gain\nGot no panties on\nI need your support now (Now, now, now, now, now)\nI know you'd rather be laid up with a big booty\nProbably hella positive 'cause she got a big booty (Wow)\nI know I'd rather be paid up\nYou know I'm sensitive 'bout havin' no booty\nHavin' nobody, only you, buddy\nCan you hold me when nobody's around us?\nOpen your heart up\nHopin' I'll never find out that you're anyone else\n'Cause I love you just how you are\nAnd hope you never find out who I really am\n'Cause you'll never love me, you'll never love me\nYou'll never love me, but I\nBelieve you when you say it like that (Say it like that)\nOh, do you mean it when you say it like that? (Say it like that)\nOh, I believe you when you say it like that (Say it like that)\nYou must really love me\n(Heart up)\n(Never find out that you're—)\n(Heart up)\n(Never find out that you're—)\nYou don't have shit to say to me, I ain't got shit to say to you\n(And that's the truth)\nAnd step, and step on\nAlso you Black heffa, yeah, you, you stand your ground\n'Cause I, I feel the same way\nIf you don't like me, you don't have to fool with me\nBut you don't have to talk about me or treat me mean\nI don't have to treat you mean\nI just stay out of your way\nThat's the way we work that one50Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "F2F",
    "lyrics": "I been thinkin' 'bout you, haven't got much sleep\nWorried that you already done replaced me\nWorried I done took it too far and you too hurt to hear me\nSmokin' on a Backwood 'cause I miss my ex\nNow I'm ovulatin' and I need rough sex\nKnowin' you gon' block me tomorrow, can you still come and get me?\nMissin' my daddy when the nights get cold\nWishin' I didn't wanna sell my soul\nWishin' that it wasn't so hard, man, I'm on my knees\nGet a rise out of watchin' you fall\nGet a kick out of missin' your call\nI hate me enough for the two of us\nHate that I can't let go of you enough, this why\nI fuck him 'cause I miss you\nI fuck him 'cause I really miss you\nI fuck him 'cause I miss you\nI just had to get my rocks off\nYou got no loyalty, you push me 'til I pop off\nI beg for empathy, you gave me nothing\nSo hard without you (So hard without you)\nI feel it coming, you gon' find anothеr one\nTo keep you calm and tuck you in at night, I wonder\nWill you call me? Will you hang mе out to dry?\nSee SZA LiveGet tickets as low as $151You might also like\nMissin' my daddy when the nights get cold\nWishin' I didn't wanna sell my soul\nWishin' that it wasn't so hard, man, I'm on my knees\nGet a rise out of watchin' you fall\nGet a kick out of missin' your call\nI hate me enough for the two of us\nHate that I can't let go of you enough, this why\nI fuck him 'cause I miss you\nI fuck him 'cause I really miss you\nI fuck him 'cause I miss you\nI'm lookin' for comfort, I knew all along\nI knew that you loved her, since we droppin' bombs\nI fuck him 'cause I miss you\nI fuck him 'cause I really miss you\nI fuck him to forget you\nI fuck him 'cause I miss you\nI try to run, but I don't block 'em\nFuck 'em, but I don't cuff 'em\nI fuck 'em 'cause I miss you5Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Forgiveless",
    "lyrics": "Ayy, dawg, yo, yo, yo\nYo, yo, yo, yo, yo, yo\nI'm the original G-O-D\nMakin’ young ladies scream is my specialty\nWhen I go da-da-da-da-da-da-da, girls get hype\nI'm the funky rap music, stereotyped\nWhen I kill that ol' mad rugged flow\nNot sayin’ Ason, duck of the disco\nOr the disco duck, strictly hip-hop\nBaby, baby, I can't stop\nI don't care 'bout consequences, I want my lick back\nI don't mind who's watchin', get to pushin' your wig back\nI don’t mind burnin’ bridges, love my enemies, center peace\nCall that bitch my kid, she ain't no kin to me\nGotta watch how you whisper when you around me, though\nGive a fuck what you prefer, I’m too profound to go\nBack and forth with no average dork\nIt goes spells and sorcery, hug your rosariеs\nI don't mind competition, it is what it is\nYou don't mind second fiddle, that's why you a bitch\nYou don’t think for yoursеlf and that's none of my business\nYou take it I dish it, I'm genie, three wishes\nBetter watch how you think out loud if it's 'bout me, though\nGot a couple that's outside, they kill about me, though\nI don't need nobody help, angels surround me, though\nBack and forth it go, it's hard, I know\nSee SZA LiveGet tickets as low as $151You might also like\nI thought I told you before\nIt's not gon' end how you want\nNot in the dark anymore\nI might forgive it, I won't forget it\nI thought I told you before\nIt's not gon' end how you want\nNot in the dark anymore\nI might forgive it, I won't forget it\nThis is that old West Coast, East Coast\nNorth Coast, South Coast shit\nYo, yo, this is that ol' boogie nights\nSuppose to boogie old type shit\nYo, yo, yo, I wanna give a special shoutout\nAll my niggas and niggarettes\nAll race, creed and colors\nIt's all love, my nigga5Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Shirt",
    "lyrics": "Kiss me dangerous\nBeen so lost without you all around me\nGet anxious\nLead me, don't look back\nIt's all about you\nIn the dark right now\nFeelin' lost, but I like it\nComfort in my sins and all about me\nAll I got right now\nFeel the taste of resentment\nSimmer in my skin, it's all about\nBloodstain on my shirt\nNew bitch on my nerves\nOld nigga got curved\nGoin' back on my word\nDamn, bitch, you so thirsty\nStill don't know my worth\nStill stressin' perfection\nLet you all in my mental\nGot me lookin' too desperate\nDamn (You ain't deserve)\nSee SZA LiveGet tickets as low as $151You might also like\nBroad day, sunshine\nI'll find a way to fuck it up still\nCan't cry about the shit that I can't change\nJust my mind\nGotta get outta here\nTough crowd, hate it\nCan't stay\nIn the dark right now\nFeelin' lost, but I like it\nComfort in my sins and all about me\nAll I got right now\nFeel the tastе of resentment\nSimmеr in my skin, it's all about\nBloodstain on my shirt\nNew bitch on my nerves\nOld nigga got curved\nGoin' back on my word\nDamn, bitch, you so thirsty\nStill don't know my worth\nStill stressin' perfection\nLet you all in my mental\nGot me lookin' too desperate\nDamn\nIt's what you say and how you do me\nHow I'm 'posed to trust, baby? 'Posed to love?\nIt ain't 'posed to hurt this way\nAll I need is the best of you\nBaby, how I got to say it? Give me all of you\nIn the dark right now\nFeelin' lost, but I like it\nComfort in my sins and all about me\nAll I got right now\nFeel the taste of resentment\nSimmer in my skin, it's all about\nBloodstain on my shirt\nNew bitch on my nerves\nOld nigga got curved\nGoin' back on my word\nDamn, bitch, you so thirsty\nStill don't know my worth\nStill stressin' perfection\nLet you all in my mental\nGot me lookin' too desperate\nDamn (You ain't deserve)40Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Kill Bill",
    "lyrics": "I'm still a fan even though I was salty\nHate to see you with some other broad, know you happy\nHate to see you happy if I'm not the one drivin'\nI'm so mature, I'm so mature\nI'm so mature, I got me a therapist to tell me there's other men\nI don't want none, I just want you\nIf I can't have you, no one should\nI might\nI might kill my ex, not the best idea\nHis new girlfriend's next, how'd I get here?\nI might kill my ex, I still love him though\nRather be in jail than alone\nI get the sense that it's a lost cause\nI get the sense that you might really love her\nThis text gon' be evidence, this text is evidence\nI tried to ration with you, no murders or crime of passion, but damn\nYou was out of reach\nYou was at the farmer's market with your perfect peach\nNow I'm in the basement plannin' home invasion\nNow you layin' face-down, got me singin' over a beat\nSee SZA LiveGet tickets as low as $151You might also like\nI'm so mature, I'm so mature\nI'm so mature, I got me a therapist to tell me there's other men\nI don't want none, I just want you\nIf I can't have you, no one will\nI might (I)\nI might kill my ex, not the best idea\nHis new girlfriend's next, how'd I get here?\nI might kill my ex, I still love him though\nRather be in jail than alone\nI did it all for love (Love)\nI did it all on no drugs (Drugs)\nI did all of this sober\nI did it all for us, oh\nI did it all for love (Love)\nI did all of this on no drugs (Drugs)\nI did all of this sober\nDon't you know I did it all for us? (I'm gon' kill your ass tonight)\nOh, I just killed my ex, not the best idea (Idea)\nKilled his girlfriend next, how'd I get here?\nI just killed my ex, I still love him though (I do)\nRather be in hell than alone73Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Used",
    "lyrics": "Yeah, I'll cuss your ass out in a minute\nYes, I've been used to being used like this\nAin't no difference, I'm immortalized in my thoughts\nPraise to the most high for protection\nOver my most prized possessions\nTalkin' 'bout my sanity's at a 6.7\nHandin' out poinsettias\nTo my dead homie mothers, prayin' they feel better\nMight get chipped mindin' my business\nMight get chipped sharin' my vision\nMight as well\nCan you tell if it's even worth conversation?\nHit a prayer, do it even work?\nAll that's for real is forever\nMoments stolеn taste better\nI been ridin', ridin' through this cold world\nThought you had anothеr one, went and caught him with ol' girl\nI feel like it's over\nSomething's callin' you, get closer\nI'm out of touch, I need a level that's a mile away\nNeed you once, girl, once, girl\nWe're goin' out the way\nI feel like it's over\nSomething callin' to get closer\nSee SZA LiveGet tickets as low as $151You might also like\nCount my blessings twice as much\nLet death stress me too much\nCan't hide from pressure, too worried I'm livin' a lie\nCan't trust nobody you ain't been broke with\nNiggas love to break my focus, bitch, I'm Obi Wan\nYou caught in the maze, I\nThought it'd be easy to get myself what I needed, but it takes some time\nAnd I'm out of patience, I burned it with you\nCan't lose myself to your ego, I wanna say\nLove me better when you try less\nI don't take much, just need your honesty, oh\nLove will work better when you confess\nFeelings don't need discussion\nSpend my life discoverin' new shit\nI been ridin', ridin' through this cold world\nThought you had another one, went and caught him with ol' girl\nI feel like it's over\nSomething's callin' you, get closer\nI'm out of touch, I need a level that's a mile away\nNeed you once, girl, once, girl\nWe're goin' out the way\nI feel like it's over\nSomething callin' to get closer3Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Blind",
    "lyrics": "Niggas want me to get ratchet\nNiggas want me to attack it\nPut the hood on, now they callin' me Cassius\nRaunchy like Bob Saget\nGreedy, I can't pass it\nEatin' everything, nigga, no fasting\nI don't care how much you knew me in the past tense\nI ain't no Julia Stiles, this ain't no last dance, way past it\nWay\nFuckin' on my ex 'cause he validate me\nFuckin' up a check, I don't want no receipt\nMight get possessed, let my spirit speak freely\nHey, my past can't escape me\nMy pussy precedes me\nMy, my, how the times change\nI'm still playin' the victim\nAnd you still playin' the pick-me\nIt's so embarrassing\nAll of the things I need living inside of me\nI can't see it\nIt's so embarrassing\nAll of the love I seek living inside of me\nI can't see, I'm blind\nSee SZA LiveGet tickets as low as $151You might also like\nBlind, blind\nYou ain't getting your bitch back\n\"Calm down, shit could be worse,\" never say that\nI don't wanna pipe down, rather get payback\nMama told me never shit where you lay at\nI don't want righteousness\nI hurt too much, I lost too much, I lust too much\nI hit my clutch and vroom\nThird day, pop out the tomb\nI love when you pull your gun at the red light\nI like all that violence, give me dysfunction\nI like when you come, never stay the whole night\nBetter when you high, never tell me I'm wrong\n'Cause my past can't escape me\nMy pussy precedes me\nMy, my, how the times change\nYou still talking 'bout babies\nAnd I'm still taking a Plan B\nIt's so embarrassing\nAll of the things I need living inside of me\nI can't see it\nIt's so embarrassing\nAll of the love I seek living inside of me\nI can't see, I'm blind\nBlind, blind\nBlind, blind24Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Seek & Destroy",
    "lyrics": "You push me past my own capacity, boy\nPermission to crash, collectin' damages, boy\nNo reachin' or grabbin' for more clarity now\nSeek and destroy, all missiles deployed\nDo it to you\nI had to do it to you\nDo it to you, oh\nDon't make me do it to you\nDo it to you\nI hate to do it to you, oh\nDo what I gotta do, oh\nI can't stand it, the urge\nIs so demandin', the purge\nSo necessary, the art of war\nGoddamn it, I'm drained\nNow that I've ruined everything, I cannot complain\nNow that I've ruined everything, I'm so fuckin' free\nNow that I've ruined everything, keep it all for me\nNow that I've ruined everything, space is all I need\nSee SZA LiveGet tickets as low as $151You might also like\nDo it to you\nI had to do it to you\nDo it to you, oh\nDon't make me do it to you\nDo it to you\nI hate to do it to you, oh\nDo what I gotta do, oh\nChasin' fatter ass and fake connections\nChasin' façades in all directions\nChances are I've got no direction\nBeggin' my angels for protection (Do it to you, oh)\nDanger arise and I deflect it\nNew dick arrives and I erect it\nBeggin' my angels for protection\nThankin' my stars, livin' reckless, oh\nDo it to you\nI had to do it to you\nDo it to you, oh\nDon't make me do it to you\nDo it to you\nI hate to do it to you, oh\nDo what I gotta do, oh\nAll the pain I know\nIs used to fuel my soul\nNo control\nI do it to you, do it to you, uh\nAll the hurt I know\nIs used to heal my soul\nNo control\nI do it to you, do it to you, oh6Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Notice Me",
    "lyrics": "You stay on my mind, I can't regret no times spent with you\nAnd I still wonder if you notice me, yes\nOut of my line if I box with you\nOut of my line if I check your line when you're not around\nOut of my lane if I get beside myself, I can't rock with you\nCan't decide right now\nEither way I'm bustin' through tonight with you\nTop down in the C3, speedin' way to you\nYes, sir, when you see me, toot that thing like\nAll of this and more when you 'bout me\nAll of this and joy will surround you\nLong as you got me\nI don't wanna be your girlfriend\nI'm just tryna be your person\nI don't need to be your girl, uh\nCool with just bein' your person, uh\nAlready tried to be your girl\nWe can't еven speak, but you stay on my mind\nI can't regrеt no times spent with you\nAnd I still wonder if you notice me, yes\nSee SZA LiveGet tickets as low as $151You might also like\nIf I had a dime or two\nFor that cheap shit you be spittin', I'll provide the mood\nIt's cool, but you be jockin' me for all my jewels\nDamn, fan nigga\nHit it then lost your mind, hmm, I understand, man\nSaid all of this and more\nFinna take me a ride to the shore now\nFinna sign me some lines, need insurance\nI can't lack niggas, can't hang, I just get more real, oh\nI don't wanna be your girlfriend\nI'm just tryna be your person\nI don't need to be your girl, uh\nCool with just being your person, uh\nAlready tried to be your girl\nI'ma get the dick that I deserve, yeah, yeah\nTry to flip on me, I hit you where it hurts, yeah, yeah\nTried to wife you, but you'd rather be a ho, yeah\nSo I spit this shit to let these niggas know, yeah, yeah\nYeah, yeah, yeah, yeah\nI told you you don't need no girl, uh\nWay you move gon' get you hurt, I swear\nBet you don't even miss your girl\nWe can't even speak1Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Conceited",
    "lyrics": "I don't like nobody, I don't feel guilty about it\nI just got my body done, ain't got no guilt about it\nI just heard your opinion, I could've did without it\nAll these bitches is minions, despicable like, oh (Oh)\nFeelin' like Mike Lowrey, oh\n'Bout to bump my salary up, oh (Oh)\nHeard they counting me out\nLove it when they counting me out, oh\nI got no reason to depend on you\nNo reason to make friends, I'm cool, oh\nI got no reason to depend on you\nNo reason to make friends, I'm cool\nI got everything that I need and I want more\nI can't take my foot off they neck, it's an encore\nI got everything and I'm livin' all for rеvenge\nI been burnin' bridges, I'd do it ovеr again\n'Cause I'm bettin' on me, me, me\nMe, me, me\nOh, I'm bettin' on me, me, me\nMe, me, me\nMe, me, me, oh\nSee SZA LiveGet tickets as low as $151You might also like\nHeard you fuckin' these lames and ain't lose no sleep about it\nHo be speakin' my name, I can't lose no sleep about it\nSay that shit to my face, you know I'm gon' slide about it\nPut that bitch in her place, she ain't make no peep about it\nOh (Oh), feelin' like a billion, oh\nFeel like I might drill on your ho, oh (Oh)\nI'm just livin' my goals (Goals)\nPressure makes diamonds, can't fold, oh\nI got no reason to depend on you\nNo reason to make friends, I'm cool, oh\nI got no reason to depend on you\nNo reason to make friends, I'm cool\nI got everything that I need and I want more (More)\nI can't take my foot off they neck, it's an encore (Encore)\nI got everything and I'm living all for revenge\nI been burnin' bridges, I'd do it over again\n'Cause I'm bettin' on me, me, me\nMe, me, me\nOh, I'm bettin' on me, me, me\nMe, me, me\nMe, me, me, oh\nI'm bettin' on, I'm bettin' on me\nI'm bettin' on me, me, me, oh\nMe, me, me, me\nMe, me, me, me, me\nMe, me, me, me\nMe, me, me, me, me9Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Love Language",
    "lyrics": "Said patience ain't no virtue with you\nI done wasted plenty time pacin' around, hate this coupe\nYou had bitches on the side, I let my mind wonder too\nYou relentless, nigga, I don't need rent, nigga\nText me like I'm waiting for you to come lie to me\nRuin my day sayin' shit to hurt me, I can't compete\nStill on the way, I lay awake if you're not around me\nI'm so on to you, still gone for you\nNeedin' you to talk to me in your love language\nShow me, yeah, how to connect to you\nHelp me understand how you speak your love language\nBad as I wanna be yours, I can't get with your program\nSex hittin' like a slow jam, stick around 'cause I want to\nBad as I wanna keep focused\nYou remind me I'm imperfect and it sucks to admit\nNobody put that purpose in me like you do, still\nNobody get that work up out me like you do\nNobody get the truth up out me quite like you\nYou the definition of my right hand\nNever mind ridin' backseat when you lead me\nSee SZA LiveGet tickets as low as $151You might also like\nTalk to me in your love language\nShow me, yeah, how to connect to you\nHelp me understand how you speak your love language\nCall me like you can't suppress memories of me\nCall me like you got confessions queued up\nLike your last bitch, lookin' chewed up, baby\nCall me like you don't regret missin' this old thing back, call me\nWhen you know the difference between me and chickens\nYou don't wanna be, be without me\nYou don't wanna live\nI don't wanna go, ooh, no\nI don't wanna be alone, oh\nAll that I know is mirrors inside me\nThey recognize you, please don't deny me2Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Gone Girl",
    "lyrics": "Ooh-ooh, ooh-ooh\nSplit mind, don't need to decide when\nStraightforward, eyes on the climbin'\nI decide no matter the climate\nBirthin' bitches in my third trimester\nShift eyes, they tell me you lyin'\nDon't care, just lay here beside me\nHang time chasin' the rewind\nHang time\nI need more space and security (Security)\nI need less voices, just you and me (Just you and me)\nI need your touch, not your scrutiny (Scrutiny)\nSqueezin' too tight, boy, you're losin' me\nBoy, you're losin'\nGone, gone, girl, gonе, girl\nYou better learn how to facе it\nShe's gone, gone, girl, so gone, girl\nNever replace her\nShe's gone, gone, girl, gone, girl\nYou better learn how to face it\nShe's gone, gone, girl, so gone, girl\nSee SZA LiveGet tickets as low as $151You might also like\nCan't think, it's too hard to process\nGet around you and I regress\nI decide what demons I digest\nI'm just tired of repeatin', I digress\nTryna find deeper meanin' in nonsense\nTryna grow without hatin' the process\nTired of anticipating the worst yet\nStill anticipating the worst (Worst)\nI need more space and security (Security)\nI need less voices, just you and me (You and me)\nI need your touch, not your scrutiny (Scrutiny)\nSqueezin' too tight, boy, you're losin' me\nBoy, you're losin'\nGone, gone, girl, gone, girl\nYou better learn how to face it\nShe's gone, gone, girl, so gone, girl\nNever replace her\nShe's gone, gone, girl, gone, girl\nYou better learn how to face it\nShe's gone, gone, girl, so gone, girl\nInward I go when there's no one around me\nAnd memories drown me, the further I go\nAnd ain't nobody talkin' 'bout the damage, pretendin' like it's all okay\nI tried to erase, I live to escape\nGone, gone, girl, gone, girl\nYou better learn how to face it\nShe's gone, gone, girl, so gone, girl\nShe's gone, gone, girl, gone, girl\nYou better learn how to face it\nShe's gone, gone, girl, so gone, girl6Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Nobody Gets Me",
    "lyrics": "Took a long vacation\nNo make-up, just JAY-Z\nYou were balls-deep, now we beefin'\nHad me butt-naked at the MGM\nSo wasted, screamin', \"Fuck that\"\nBlurry now, but I meant it then\nHurry now, baby, stick it in\n'Fore the memories get to kickin' in\nIt's too late, I don't wanna lose\nWhat's left of you\nHow am I supposed to tell you\nI don't wanna see you with anyone but me?\nNobody gets me like you\nHow am I supposed to let you go?\nOnly like myself when I'm with you\nNobody gets me, you do (Do)\nYou do\nNobody gets me, you do (Do)\nYou do\nNobody gets me, you do\nYou do\nNobody gets me, you do\nSee SZA LiveGet tickets as low as $151You might also like\nTook me out to the ballet\nYou proposеd, I went on the road\nYou was feelin' empty so you lеft me\nNow I'm stuck dealin' with a deadbeat\nIf I'm real, I deserve less\nIf I was you, I wouldn't take me back\nI pretend when I'm with a man it's you\nAnd I know that it's too late, I don't wanna lose\nWhat's left of you\nHow am I supposed to tell you\nI don't wanna see you with anyone but me?\nNobody gets me like you\nHow am I supposed to let you go?\nOnly like myself when I'm with you\nNobody gets me, you do (Do)\nYou do\nNobody gets me, you do (Do)\nYou do\nNobody gets me, you do (Do)\nYou do\nNobody gets me, you do (Do)\nNobody gets me, you do11Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Open Arms",
    "lyrics": "When you do your best you ca—, I done told you\nWhen you do your best, hell, that's all you can do\nYou and me and anybody else\nSo they always start talkin'\nRunnin' away from where I'm from\nNever can stay with no one\nLovin' you almost feels like something\nWhen no one's around me\nYou lost and found me\nI was surrounded\nWith open, open, open\nOpen arms (Ooh)\nOpen arms\nYou keep me open, I'm so devoted\nYou keep me open (Ooh)\nOpen arms\nI'm so devoted to you, to you, to you\nSpent your life bein' hopeless\nChokin' on insecurity\nI know ownership's bad\nBut please put a leash on me anyway\nWho needs self-esteem anyway?\nI hate myself to make you stay\nPush me away, I'll be right here\nWith open, open, open\nSee SZA LiveGet tickets as low as $151You might also like\nOpen arms (Ooh)\nOpen arms\nYou keep me open, I'm so devoted\nYou keep me open\nOpen arms\nI'm so devoted to you, to you, to you\nNo matter what come between us, yeah, I decided\nI'm forever ridin', we forever guided\nPull up on an opp, hit his curb up, slide it (Brr)\nNotice when you mad, ain't no words, just silence\nDrew my favorite color, now you seein' every shade of me\nYou say that I'm trippin', I hit back like, \"Where you takin' me?\"\nLocked in for life, on God, no replacin' me\nConsequences, repercussions, karma keep on changin' me\nFor you, I try\nFace card, valid ID\nC'est la vie, go to Paris\nIt ain't five-star, it ain't me\nOver-solid, keep it concrete\nI'ma bet it on you, a whole fee\nJust don't switch sides\nI could fire piece your wrist, AP\nThrough the ups and downs and all the heat\nTake a turn and tell you what it be\nBackshots make you feel relief\nAnything, just don't you ever leave\nI guess I gotta go (Ooh)\nI guess it's time to go\nI gotta let you go\n(I'm so devoted)\nYou keep me open\nGotta let you go, gotta let you go\nI gotta let you go, I must\nBut you're the only one that's holdin' me down (Ooh)\nYou're the only one holdin' me down (Only one)\n'Cause you're the only one that's holdin' me down13Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Smoking on my Ex Pack",
    "lyrics": "Roll the clip and run it back, I'm really like that\nI'm really not friendly, I need my credit, niggas hate that\nI need the numbers\nI need the data, got you talkin' crazy\nAbracadabra, you niggas sideshow\nI'm Bobbin' like psycho\nYou gassin' like Texaco\nInfection like microbe\nYou test it, I might go\nYou push it, I might pop\nI'm fuckin' on heartthrobs\nI got your favorite rapper blocked\nI heard the dick was whack\nYour favorite athlete screamin', \"Text me back\"\nI make no exception\nThe lesser part of me loves all the cap\nHe screamin', \"Get back togеther\"\nI'm screamin', \"Back of the bus, trick\"\nHawaii for wеather\nBooty softer than leather\nThese hoes is featherweight\nI wipe my phone and gave some dome, I beat the case\nThem \"ho\" accusations weak\nThem \"bitch\" accusations true\nYou hatin' from nosebleeds, I wish you well\nSee SZA LiveGet tickets as low as $151You might also like\nSmokin' on my ex pack tonight\nSmokin' on—\nYou can trust in me\nI can, you said\n\"I can trust in you\"\nI can, I can\nYou can trust in me\nYou can, you can\nOh, oh4Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Too Late",
    "lyrics": "Too late for us\nWe both dangerous\nMovin' so close, we combust\nIs it bad that I want more?\nI been gone so long, I don't know where I'm going\nYou be on my phone, talkin' 'bout what's my problem?\nHad to go alone to get it how I wanted\nHad to be alone to figure out how I should be loved\nAnd if it's just us, is that enough?\nIs it bad that I want more?\nIs it too late for us?\nWe both dangerous\nMovin' so close, we combust\nIs it bad that I want more?\nIs it too late for us?\nWe both scared of love\nMovin' so close, we combust\nIs it bad that I want more?\nSee, bust it like a toolie in your waistband\nBust it like that booty too big and you need two hands\nBust it like you catchin' a body and you in G stance\nBust it like it's casual Friday and you herе to dance\nCall bluff, I know what's up\nCan't get enough\nIs it bad that I want morе?\nSee SZA LiveGet tickets as low as $151You might also like\nIs it too late for us?\nWe both dangerous\nMovin' so close, we combust\nIs it bad that I want more?\nIs it too late for us?\nWe both scared of love\nMovin' so close, we combust\nIs it bad that I want more?\nMmm, pressure, I won't learn my lesson\nI want you to stretch it\nLimit, want you to test it\nI know I was born to roll\nI gotta know\nIs it bad that I want more?\nIs it too late for us?\nWe both dangerous\nMovin' so close, we combust\nIs it bad that I want more?\nIs it too late for us?\nWe both scared of love\nMovin' so close, we combust\nIs it bad that I want more?\nSo done with you\nNobody hurt me like you do\nEvery time you break my heart, it feel new\nEvery time I fall apart, I call you\nI just wanna be loved\nAnd loving you sucks\nI can't get enough\nIs it bad that I want more?\nIs it too late for us?3Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Far",
    "lyrics": "How do I deal with rejection?\nI'm dealing with a lot of rejection right now\nIt makes me feel very small\nOh, that's great\nIf nobody wants you, you're free\nTried to wash all of my shit away\nTried to wash all my emotions\nNeed a few brews, need a palm tree\nI be drinkin' in private, don't call me to party, though\nFuck on your nigga for cardio\nToo good, he really fell in love right away\nI put my feelings on layaway, I'm\nDone being used, done playing stupid\nDone faking cool\n(I don't want none of that shit, I don't want it)\nDone being screwed, done feeling clueless\nThat's how you do\n(I don't want none of that shit, got me runnin' so)\nFar, far like I don't recognize me\nFar, far 'causе I let you define mе\nI'm far, far 'cause I can't trust nobody\nFar, stay far, so far\nSee SZA LiveGet tickets as low as $151You might also like\nLately, I feel less cool as before\n(Nobody under my garter belt)\n(Nobody out here to tell me I'm special)\nMade you check your bullshit at the door\n(Got an appetite, hungry to feed my ego)\n(Nobody 'round me to be my hero)\nAlways on my mind, trust is hard to find\nEverything reminds me of us\nI just want my sanity back\nBetter than being your enemy\n(Better than letting go, scared of that, oh)\nDone being used, done playing stupid\nDone being cool\n(I don't want none of that shit, I ain't goin')\nDone getting screwed, done playing clueless\nThat's how you do\n(I don't want none of that shit, got me runnin' so)\nFar, far like I don't recognize me\nFar, far 'cause I let you define me\nI'm far, far 'cause I can't trust nobody\nFar, stay far, so far\nI remember when you had me upside-down\nStress me out and turn me out, it's all bad now\nI remember when I wasn't so burnt out\nI'd rather that than be your enemy, ready to let it go\nDraggin' me far, far like I don't recognize me\nFar, far 'cause I let you define me\nI'm far, far 'cause I can't trust nobody\nFar, stay far, so far7Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Low",
    "lyrics": "Tell 'em to shoot\nI'm out the loop, I'm out of range\nOh, I stay out the way\nGot another side of me, I like to get it poppin'\nBut these bitches in my business got me outchea choosin' violence\nIf you see me out in public, you don't know me, keep it silent\nIn the bedroom, I be screamin', but outside, I keep it quiet\nKeep it on the lowski, I'm the lowest of the lowest\nWanna see if you can keep it like nobody know shit\nI need you to get the fuck out my space (Yeah)\nReplacement's on the way, please don't play\nThat pussy's feelin' like a great escape (Oh, oh)\nI need a new trick, old dogs don't change\nI'm fuckin', I ain't makin' love no more (Pussy)\nYou got a new bitch, what the fuck you cryin' for?\nI'm movin' selfish, callin' all my favorite hoes\nYou know how to reach me every time and it plays in your mind\nWith a rush that feels like we committed a crime\nKnow where you belong, I'm gon' save you a spot\nBut can't be outside 'cause the block is too hot\nAnd I'm all on your mind\nWherever you are, don't call me (Let's go)\nSee SZA LiveGet tickets as low as $151You might also like\nGot another side of me, I like to get it poppin' (Alright)\nBut these bitches in my business got me outchea choosin' violence (Yeah, yeah)\nIf you see me out in public, you don't know me, keep it silent (Okay)\nIn the bedroom, I be screamin', but outside, I keep it quiet\nKeep it on the lowski, I'm the lowest of the lowest\nWanna see if you can keep it like nobody know shit (Let's–)\nKeep it on the lowski, I'm the lowest of the lowest\nWanna see if you can keep it like nobody know shit\nI need total confidential privacy (Yeah)\nDon't want no one thinkin' I'm a groupie (It's lit)\nTimezones change, now we on a first-class trip (Straight up)\nDon't work my nerves, you know I get moody\nWe fuckin', we ain't makin' love no more\nYou talk that talk, but it don't match it with your stroke\nWherever you are\nWhatever you need\nDon't call me\nGot another side of me, I like to get it poppin'\nBut these bitches in my business got me outchea choosin' violence (Alright)\nIf you see me out in public, you don't know me, keep it silent\nIn the bedroom, I be screamin', but outside, I keep it quiet\nKeep it on the lowski, I'm the lowest of the lowest\nWanna see if you can keep it like nobody know shit\nKeep it on the lowski, I'm the lowest of the lowest\nWanna see if you can keep it like nobody know shit (Let's–)\nFuck you, real shit\nI wasn't even on \"fuck you\"\nBut you tryna make me look stupid\nI'll slap the dog shit out of you, stop playin' with me17Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Ghost in the Machine",
    "lyrics": "Everything disgusting, conversation is so boring\nHeard about what?\n\"I hate her,\" \"I don't agree,\" \"I did it first\"\nI give a fuck\nI just wanna fuck, eat, sleep, love happy\nCan you make me happy? Can you keep me happy?\nCan you distract me from all the disaster?\nCan you touch on me and not call me after?\nCan you hate on me and mask it with laughter?\nCan you lead me to the ark? What's the password?\nI need humanity\nY'all lack humanity, drowning in vanity\nCraving humanity\nY'all lack humanity, I need humanity\nI need–\nEverybody wanna be beautiful, scared of the unusual\nScared of givin' mutual respect, all that you hate\nYou reflect all that godlike, you forget how to love somebody\nI hate everybody, I hatе everyone\nLеt's talk about A.I., robot got more heart than I\nRobot got future, I don't\nRobot get sleep, but I don't power down\nI'm wide open, I'm awake, I'm on autopilot\nI'm out of my mind and I'm wide open\nSee SZA LiveGet tickets as low as $151You might also like\nCan you distract me from all the disaster?\nCan you touch on me and not call me after?\nCan you hate on me and mask it with laughter?\nCan you lead me to the ark? What's the password?\nI need humanity\nY'all lack humanity, drowning in vanity\nCraving humanity\nY'all lack humanity, I need humanity\nI need–\nYou said all of my friends are on my payroll\nYou're not wrong, you're an asshole\nScreaming at you in the Ludlow\nI was yours for free\nI don't get existential\nI just think about myself and look where that got me\nStandin' on my own in an airport bar or hotel lobby\nWaiting to feel clean\nThat's so fucking boring\nCan you distract me from all the disaster?\nCan you touch on me and not call me after?\nCan you hate on me and mask it with laughter?\nCan you lead me to the ark? What's the password?\nI need humanity\nY'all lack humanity, drowning in vanity\nCraving humanity\nY'all lack humanity, I need humanity\nI need–\nThose who have forsaken their humanity\nThey like to patch their life with morality\nI think I might be tryna patch my life with morality\nI'm curious, I'm curious13Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "SOS",
    "lyrics": "Last night, I cried\nGive me a second, give me a minute\nNah, lil' bitch, can't let you finish\nYeah, that's right, I need commissions on mine\nAll that sauce you got from me\nAll that shit I gave for free\nI want it back, want it back\nThis ain't no warnin' shot\nCase all you hoes forgot\nKnow you been more than lost\nWithout me, I'm so\nComin' back, I'm so greasy\nEx-nigga, he so needy\nPunk ass tried to replace me, but the stakes is too high\nThey can't survive off mini-me\nI'm talkin' pedigree\nAin't no writers, that's just me\nAin't no spiteful, I'm just tea\nCan't hate a bitch for free\nTalkin' I'm off the bench like Brady\nI'm pressin' niggas like KD, it's up\nYeah, nigga, it's up to me\nRemind you of Dеlla Reese\nSo classic, that ass so fat, it look natural, it's not\nI talk bullshit a lot\nNo more fuck-shit, I'm done\nDamn right, I'm thе one\nDamn right, I'm the one\nComin' back, she so candid\nComin' back snatched like bandit\nComin' back, this ain't canned shit\nI'm organic with my fresh squeezed\nI'm dumpin' like press squeeze\nI'm horny like, \"Suck these\"\nSo daring like, \"Touch me\"\nAnd all the petty shit aside\nAll the funny shit aside\nI just want what's mine\nMine, oh\nI just want what's mine\nThis ain't no warnin' shot\nCase all you hoes forgot\nAnd I cried and cried\nSaid what's on my mind\nOoh, oh, I criedSee SZA LiveGet tickets as low as $151You might also like7Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Snooze",
    "lyrics": "Ooh\nI think I know\nI'll touch that fire for you\nI do that three, four times again, I testify for you\nI told that lie, I'd kill that bitch\nI do what all of them around you scared to do, I'm not\nLong as you juggin' out here for me, I got it\nMobbin', schemin', lootin', hide your bodies\nLong as you dreamin' 'bout me, ain't no problem\nI don't got nobody, just with you right now\nTell the truth, I look better under you\nI can't lose when I'm with you\nHow can I snooze and miss the moment?\nYou just too important\nNobody do body like you do\nI can't lose when I'm with you\nI can't just snooze and miss the moment\nYou just too important\nNobody do body like you do, you do\nIn a droptop ride with you, I feel like Scarface (Scarface)\nLike that white bitch with the bob, I'll be your main one (Your main one)\nLеt's take this argument back up to my place (My placе)\nSex remind you I'm nonviolent, I'm your day one (Day one)\nWe ain't have shit yet, it was magic, yeah\nSmash and grab shit, yeah\nNasty habits take a hold when you not here\nAin't a home when you not here\nHard to grow when you not here, I'm sayin'\nSee SZA LiveGet tickets as low as $151You might also like\nI can't lose when I'm with you\nHow can I snooze and miss the moment?\nYou just too important\nNobody do body like you do\nI can't lose when I'm with you\nHow can I snooze and miss the moment?\nYou just too important\nNobody do body like you do, you do\nMain one ridin'\nHow you frontin' on me and I'm the main one tryin'?\nHow you blame it on me and you the main one lyin'?\nHow you threatenin' to leave and I'm the main one cryin'?\nJust tryna be your everything\nMain one ridin'\nHow you frontin' on me and I'm the main one tryin'?\nHow you blame it on me and you the main one lyin'?\nHow you threatenin' to leave and I'm the main one cryin'?\nI can't lose when I'm with you (Like you, like you)\nHow can I snooze and miss the moment? (Like you)\nYou just too important\nNobody do body like you do\nI can't lose when I'm with you (Like you)\nHow can I snooze and miss the moment? (Like you)\nYou just too important\nNobody do body like you do, you do\nNah, nah, nah, nah\nI think I know, woah\nSee, no, I can't lose, oh\nI think I know, oh14Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Special",
    "lyrics": "I wish I was that girl from that Gucci store\nShe never wore any makeup and she owns couture\nI got pimples where my beauty marks should be\nI got dry skin on my elbows and knees\nI never liked her, wanted to be like her\nHate how you look at her 'cause you never saw me\nLike I was an art piece, like I was an ordinary girl\nI wish I was special\nI gave all my special\nAway to a loser\nNow I'm just a loser\nI used to be special\nBut you made me hate me\nRegret that I changed me\nI hate that you made me\nJust like you\nI wanted to be thick, now I wanna be thin\nHeard Pilates is in, bash your windows out\nYou gon' hear my mouth, you could kick me out\nYou say I'm too wild, you gon' hate me now\nBoy, you got me fucked up, now I'm gettin' fucked up\nThinkin' 'bout us fucking, why you'd have to fuck her?\nI don't wanna see you, why'd you have to treat me\nLike I was an ordinary girl?\nSee SZA LiveGet tickets as low as $151You might also like\nI wish I was special\nI gave all my special\nAway to a loser\nNow I'm just a loser\nI used to be special\nBut you made me hate me\nRegret that I changed me\nI hate that you made me\nJust like you\n(Just like you)\n(Just like you)10Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "Good Days",
    "lyrics": "Good day in my mind, safe to take a step out\nGet some air now, let yo edge out\nToo soon, I spoke\nYou be heavy in my mind, can you get the heck out?\nI need rest now, got me bummed out\nYou so, you so, you\nBaby, baby, babe\nI've been on my empty mind shit\nI try to keep from losin' the rest of me\nI worry that I wasted the best of me on you, babe\nYou don't care\nSaid, \"Not tryna be a nuisance, this is urgent\"\nTryna make sense of loose change\nGot me a war in my mind\nGotta let go of weight, can't keep what's holdin' me\nChoose to watch while the world break up in front of me\nAll the while, I'll await my armored fate with a smile\nStill wanna try, still believe in\nGood days, good days, always\nAlways inside (Always in my mind, always in my mind, mind)\nGood day living in my mind\nSee SZA LiveGet tickets as low as $151You might also like\nTell me I'm not my fears, my limitations\nI disappear if you let me\nFeelin' like, yeah (On your own)\nFeelin' like Jericho\nFeelin' like Job when he lost his shit\nGotta hold my own, my cross to bear alone, I\nOoh, played and dipped, way to kill the mood\nKnow you like that shit\nCan't groove it, ba-baby\nHeavy on my empty mind shit\nI gotta keep from losin' the rest of me (Rest of me)\nStill worry that I wasted the best of me on you, babe\nYou don't care\nSaid, \"Not tryna be a nuisance, this is urgent\" (It's urgent)\nTryna make sense of loose change\nGot me a war in my mind (My mind)\nGotta let go of weight, can't keep what's holdin' me\nChoose to watch while the world break up in front of me\nAll the while, I'll await my armored fate with a smile\nStill wanna try, still believe in\nGood days, good days, always (Good days on my mind, good days on my mind)\nSunny inside (Always in my mind, always in my mind, mind)\nGood day living in my mind\nGotta get right\nTryna free my mind before the end of the world\nI don't miss no ex, I don't miss no text\nI choose not to respond\nI don't regret, just pretend shit never happened\nHalf of us layin' waste to our youth, it's in the present\n(Na-na, na-na, na-na, na)\nHalf of us chasin' fountains of youth and it's in the present now\nAlways in my mind, always in my mind, mind\nYou've been making me feel like I'm\nAlways in my mind, always in my mind, mind185Embed"
  },
  {
    "album": "SOS",
    "lyrics_title": "I Hate U",
    "lyrics": "I be so sick of you niggas, y'all contradicting\nI be so bored with myself, can you come and fuck me?\nI feel so ordinary, sad when you around me\nTreat me like corduroy, wear me out\nArguments, you air me out\nTripping 'bout your whereabouts\nI can't keep no conflict with you, boy, can we just rub it out?\nI don't want no static with you, you know you my plug\nAnd I can't shake this habit, no\nI've been up, baby\nHeavy reminiscin'\nHeavy on the missing you\nWish it was different than what it was (Oh, no)\nI've been up, baby\nLost in the lie of us\nLost, ain't no findin' us\nI've been up, baby\nAnd if you wonder if I hate you (I do)\nShitty of you to make me feel just like this\nWhat I would do to make you feel just like this\nAnd if you wondered if I hate you (Fuck you)\nShitty of you to make me feel just likе this\nWhat I would do to make you feel just like this\nSee SZA LiveGet tickets as low as $151You might also like\nUsed to bе too solid 'til you scrambled me\nUsed to be your rider, you mishandle me\nUsed to be nonviolent 'til you ambushed me\nNow I'm out here wildin' with you\nNow I'm out here, silent treatment, that mean no permission (No)\nMissionary gettin' boring, can you switch positions? (Yeah)\nHard to save your soul, you don't ever listen, no (No)\nI've been up, baby\nHeavy reminiscin'\nHeavy on the missing you\nWish it was different than what it was (Oh, no)\nI've been up, baby\nLost in the lie of us\nLost, ain't no findin' us\nI've been up, baby\nAnd if you wonder if I hate you (I do)\nShitty of you to make me feel just like this\nWhat I would do to make you feel just like this\nAnd if you wondered if I hate you (Fuck you)\nShitty of you to make me feel just like this\nWhat I would do to make you feel just like this37Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Omega",
    "lyrics": "Let the church say amen\nRelease all my sins at the pulpit\nIt's the beginning\nIt's the beginning Of Mice and Men\nYou hold my hand as an infant\nPalms to the sky, Adonai, Ya Allah\nTill they all come down\nTill we all fall down\nDown\nLines drawn in the sand\nKeep the sun at your back\nKeep your feet firmly planted in the sky\nJust ride\nWhen you don't know yourself\nIf it hurts you to explain your God in my eyes\nJust ride\nLines drawn in the sand\nKeep the sun at your back\nKeep your feet firmly planted in the sky\nJust ride\nUp here the air is so thin\nMountains on my fingertips\nI stand at the tippy, screaming at the top of my lungs\nTears in my eyes\nAdonai, Ya Allah, answer my calls if you hear me\nAdonai, Ya Allah, answer my calls if you're near me\nSee SZA LiveGet tickets as low as $151You might also like\nLines drawn in the sand\nKeep the sun at your back\nKeep your feet firmly planted in the sky\nJust ride\nWhen you don't know yourself\nIf it hurts you to explain your God in my eyes\nJust ride\nLines drawn in the sand\nKeep the sun at your back\nKeep your feet firmly planted in the sky\nJust ride\nWhen you don't know yourself\nIf it hurts you to explain your God in my eyes\nJust ride\nIt's the beginning\nIt's the beginning14Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Sweet November",
    "lyrics": "Jesus called me collect last night\nIt took all of me not to answer\nDaddy warned me the perils of playing\nHard to get with God as his standard\nFlying high and fearless baby\nI've kissed death a thousand times before\nRemember me for who I was not who I am\nI'll pray you never understand this sweet\nSweet, sweet, sweet November\nRemember me for who I was not who I am\nI'll pray you never understand this sweet\nSweet, sweet, sweet November\nTake (take) time (time)\nFlow (flow) shine (shine)\nBrilliant (brilliant) light (light)\nAngel (angel) fly (fly)\nHeard you fucking with Tommy again\nWe both 'member where that landed you last time\nThat nigga don't really love you girl\nHe just beds you every night, it's his past-time\nBlind eye and the fearless, darling\nYou two might just do it raw tonight\nHeaven help if he leave you girl\nI bet you bought two new thongs this time\nSee SZA LiveGet tickets as low as $151You might also like\nRemember me for who I was not who I am\nI'll pray you never understand this sweet\nSweet, sweet, sweet November\nRemember me for who I was not who I am\nI'll pray you never understand this sweet\nSweet, sweet, sweet November\nHurts right, broken stride30Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Shattered Ring",
    "lyrics": "It's up for discussion, up for reprise\nSlowly re-thinking if current disguise deceives me\nThe Shattered Ring\nI can see it in your eyes\nReady or not\nLoaded heart with a dagger\nAim for your sweet spot\nI know you'd rather be scared of\nI know you'd rather I just disappear\nNow that I'm here\nI know you'd rather\nGiddy up Goldilocks, you took too long to save me\nBumping that Jadakiss is dangerous for sanity\nOpen my candy box for you sir, sugar daddy\nLook at how drunk we are, spent the night dancing\nSpent the night dancing\nReady or not\nLoaded heart with a dagger\nAim for your sweet spot\nI know you'd rather be scared of\nI know you'd rather I just disappear\nNow that I'm here\nI know you'd rather\nSee SZA LiveGet tickets as low as $151You might also like\nTake me up, take me up\nI wanna live in your hot love balloon\nReady or not\nTake me up, take me up\nIn your hot love balloon\nTake me up, take me up\nI wanna live in your hot love balloon\nReady or not\nLoaded heart with a dagger\nAim for your sweet spot\nI know you'd rather be scared of\nI know you'd rather I just disappear\nNow that I'm here\nI know you'd rather\nDisappear5Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Ur",
    "lyrics": "Dnim fo etats a si ytiralC\nDnim fO\nClarity is a state of mind\nFreedom ain't real, who's sold you that lie?\nI ain't buying it\nNo matter what the price (one more time? I'm sorry)\nSo give it up, give it up mama\nUndo your pants and your bra\nI see you liking that, you must need a slice\nType A personality\nExtrovert, introvert, commonalities\nA Type A personality\nJust dumb enough to lie to me\nYou are, you are, you are, you are\nYou are, you are, you are, you are (we are)\nYou are, you are, you are, you are\nSuperficial superwoman\nAin't you tired of that wind in your face?\nYour skin taste likes brussell sprouts I swear\nCan't seem to remember your face\nSo give it up, give it up papa\nMake it make sense to me\nI can not go any further\nThan 2 steps in-front of me, I'm lost here\nSee SZA LiveGet tickets as low as $151You might also likeDum dum dum, dum dum dum\nDum dum dum, dum dum dum\nDum dum dum, dum dum\n(Whoa whoa, whoa whoa, whoa)\nDum dum dum, dum dum dum\n(Whoa whoa, whoa whoa, whoa)\nDum dum dum, dum dum dum\nYou are, you are, you are, you are (we are)\nDumb enough to lie to me\nYou are, you are, you are, you are\n(Whoa whoa, whoa whoa, whoa)\n(we are) (we are) (we are)\n(Whoa whoa, whoa whoa, whoa)\n(we are) (we are) (we are)22Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Green Mile",
    "lyrics": "Shotgun to the back of my heart\nI don't turn around to see who let one ring out\nSaid you'd never do me wrong\nGuess we see how that plays out\nIs it true? Is it true?\nHeading to the Massacre\nBodies arriving every day\nWhat were those shells you heard\nPicking the bones up along the way\nLet it ring out\nSharpshooting in my backyard\nKilled a small boy once, never told no one\nIf it wasn't for my shotgun\nHe'd be alive and I'd be halfway to heaven\nInstead of sitting in the dark, going through hell\nYou should've been here\nWish you had been here\nSee SZA LiveGet tickets as low as $151You might also like\nHeading to the Massacre\nBodies arriving every day\nWhat were those shells you heard\nPicking the bones up along the way\nLet it ring out\nShotgun to the back of my heart\nI don't turn around to see who let one ring out\nPt. II: I Doubt It\nLately I've been questioning\nAm I all that I pretend to be?\nI doubt it, I doubt it\nLately I've been questioning\nAm I all that I pretend to be?\nI doubt it, I doubt it10Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Babylon",
    "lyrics": "Crucify, cru-crucify me\nCrucify, cru-cru\nI can't recall the last time I took, advice from anyone\nShaped like a figure eight, who trusts pretty girls anyway?\nAnd I can't recall the last time I took advice from anyone\nI'm sure I'll be the death of me\nAnd I can't recall the last time I took love from anyone\nI called daddy, who's got one anyway? Not me\nAre you hating yourself? Do you really hate me?\nAre you hating yourself?\nWas it worth it? Would you do it again?\nAren't you tired (of) always making amends? Oh\nI know you hate me now (Here)\nI bet you hate me now (Here)\nBring on the thorny crown (Here)\nCru—\nCross my heart then I hope to die\nWith a peace of mind (A peace of mind)\nPiece together my brain\nSoon as this beat rewind (Beat rewind)\nNitrogen and propane\nI spike your drink at times (Turn up, turn up)\nI make it hard to swallow this game\nYou throw up every line (Every line)\nI notice people got Napoleon complexes\nThat's my confession (Yeah, that)\nYou said that we're equal but I know you're beyond guessing\nThat I'm beyond desperate (Yeah, that)\n6AM on a Friday morning, my darkest hours\nThem heartless hours, my apartment is lost in a coffin\nI'm dead to the world like I popped me a couple downers\nDown & Out on my luck\nSalt water all on my tux and I call, she don't pick up\nThen I fall when summer is ending\nI mean, there's no pretending\nI'm stuck in my ways and you're offended, that's life\nThat's you, this me, that vice\nYou're wrong, I'm right, that's right\nI belong somewhere on ice\nI'm cold, and my new blood type?\nEven colder, cold shoulder\nBorn Sinner, you know? Cole showed us!\nI have nothing to lose\nMy dark side been well in-tuned\nA Gemini gon' show them faces\nAnd this here just one of my moods, Babylon\nSee SZA LiveGet tickets as low as $151You might also like\nWas it worth it? Would you do it again?\nAren't you tired of always making amends?\nI know you hate me now (here)\nI bet you hate me now (here)\nBring on the thorny crown (here)\nCrucify me\nCrucify, cru-crucify me\nCrucify, cru-cru\nCrucify, cru-crucify me\nCrucify, cru-cru\nI'm really over the cryin' thing, wipin' my tears\nWho cries anyway? Spread like disease all over me\nWe did ungodly ghastly things, last night I mean\nWho's God anyway? You're mine any day\nIt's burning, take me\nI wanna feel your power, this final hour, tell me\nAre you losing yourself? Will you lose it for me?\nAre you losing yourself?\nWas it worth it? Would you do it again?\nAren't you tired of always making amends?\nI know you hate me now (Here)\nI bet you hate me now (Here)\nBring on the thorny crown (Here)\nCrucify me\nCrucify, cru-crucify me\nCrucify, cru-cru\nCrucify, cru-crucify me\nCrucify, cru-cru141Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Julia",
    "lyrics": "Here soon, here soon\nLoving alone is what you make it\n(Make it, make it)\nStay for the storm if you can take it\n(Take it, take it)\nBut pray for a raincoat to bare the brunt of mistakes\nI know you worry a lot if I’ll be here for you\nDo I care enough? Do I feel for you?\nI can guarantee\nCount on this one, whoa whoa\nCount on this one, oh, oh\nCount on this one, whoa whoa\nCount on this one, oh, oh\nAnd I didn’t know you tried 'cause you wanted more\nAnd I didn’t know you cried 'cause you wanted more\nThings don't happen the way you hoped to\nI’m just keeping a little hope, baby\nAnd I didn’t know you tried 'cause you wanted more\nSee SZA LiveGet tickets as low as $151You might also like\nDying of daydreams in your bedroom\n(Bedroom, bedroom)\nBeen waiting so long, said you’d be here soon\n(Here soon, here soon)\nHow could you forget that I’m the one who\nForgot all your mistakes and dirty drawers?\nYou know I care for you\nWhen hell over earth came, I stood for you\nWill you stand for me?\nCount on this one, whoa whoa\nCount on this one, oh, oh\nCount on this one, whoa whoa\nCount on this one, oh, oh\nAnd I didn’t know you tried 'cause you wanted more\nAnd I didn’t know you cried 'cause you wanted more\nThings don't happen the way you hoped to\nI’m just keeping a little hope, baby\nI didn’t know you tried 'cause you wanted more\nHere soon, here soon\nFunny how life is turning out\nI don't have much to talk about\nDon’t have much to write about\nGot a shitload to cry about\nFunny the words I do kick\nFunny the niggas I do pick\nIt’s funny what sticks\n(Go figure)\nMama said I’m sensitive\nI gotta work on that\nNot really\nTired of using adjectives, I gotta build on that\nYou feel me?\nNot really\nYoung man, tryna hold the world in a broken hand, hand\nYoung man, tryna find the world in a broken hand24Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "HiiiJack",
    "lyrics": "Go forth, spread the news\nI'm liberated\nGo on, cut the rope\nI know you hate it\nTwo knives, no fork\nWonder who'd make it?\nI'd lose for you, I choose for you\nGun fighting\nFatality, boy\nHell fire, boy\nI stay for eternity\nFor you, for you\nFor you, for you I'd stay\nFor you, for you\nFor you, for you I\nSometimes I keep you in my mind\nSometimes I let you go up high\nI'm using everything I find\nDo anything to keep you tied up\nTied up\nSee SZA LiveGet tickets as low as $151You might also like\nStationary, birds wings\nSmall canary, princess\nYoung savage girl lost among the lily pads\nOne road no choice, I've given you this\nMove moons for you, I choose to do it\nGun fighting\nFatality, boy\nHell fire, boy\nI stay for eternity\nFor you, for you\nFor you, for you I'd stay\nFor you, for you\nFor you, for you I\nUh, uh\nYeah\nSometimes I keep you in my mind\nSometimes I let you go up high\nI'm using everything I find\nDo anything to keep you tied up\nTied up\nSometimes I keep you in my mind\nSometimes I let you go up high\nI'm using everything I find\nDo anything to keep you tied up\nTied up28Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Childs Play",
    "lyrics": "Ripping the heads off all my Barbie dolls\nToss them to the side, get the convertibles\n(Click, vroom) I like the way it rides up\nKen had it all, Skipper wanted more than\nWatching from the sidelines, wish that she had it\nShe wish that she had it\nHere in your backyard, building a fantasy\nFuck reality, do you want to know, know me\nDo you want to know me?\nStuck in Nintendo, you're the controller\nStreet Fighters and such\nI yelled \"finish him\"\n(Down goes Frazier)\nI yelled \"finish him\"\nCome Desdemona, Othello and tragedies\nShakespearean sorrows, where do I begin?\nWhere do we begin?\nI got L's on my record\nWeed on the vinyl\nKeys open doors when them keys is albino\nNow knock on my door when my stars is a Lionel\nI've been fishing for a minute, for a minnow\nOnly I know that a pawn is a trade\nAnd a rookie for a castle like tuition for a final\nPlaying hooky for a tassel, spend a minute on the minor\nWins on my window\nAsh on my skin, when the record low temps for the wind blow\nOnly write rhythm to the tardiest of tempos\nOnly ride shotgun when the car is a limo\nY'ar see\nI crowd surf in a cypher\nScuba in my shower, take an Uber to my neighbors\nUsed to pay the piper, till Peter picked it better\nNow the first thing you should tell is where the hell is all the paper\nBut memories keep coming back\nAll the nights that we used to laugh\nWanna know how I used to was, how I used to was\nSee SZA LiveGet tickets as low as $151You might also like\nMemories keep playing back, all the nights we used to love\n(Here in your backyard, building a fantasy)\nJust wonder how I used to was, how I used to was\n(Fuck reality, do you want to know, know me)\nMemories keep playing back, all the nights we used to love\n(Do you want to know me?)\nJust wonder how I used to was, how I used to was\nMemories keep playing back, all the nights we used to love\nJust wondering how I used to was, how I used to was\nMemories keep playing back, all the nights we used to love\nJust wondering how I used to was, how I used to was\nMemories keep playing back, all the nights we used to love\nJust wondering how I used to was, how I used to was211Embed"
  },
  {
    "album": "Z",
    "lyrics_title": "Warm Winds",
    "lyrics": "Hey, hey, glory child, hey\nHey, glory child, don't you worry\nStuttering and shaken out of fear\nBeauty's never given in a hurry\nSo condescending, leave your questions here\nHey, glory child, don't you worry\nI can see your skeleton so clear\nDoubting's only made your visions blurry\nYou're better off just looking in the mirror\nShow me a better way, I wish you could\nShow me a better way, I wish you would\nCome home today\nYou could come home today\nI am shooting stars, don't you see me?\nWatching over your every mistake\nDigging out of graves is never easy\nHanding you my shovel here to take\nAlways playing catch-me-if-you-can\nGingerbread—you heard I'm sweet to taste\nClose your eyes, let go, and count to ten\nI'll keep track of every moment wasted\nSee SZA LiveGet tickets as low as $151You might also like\nShow me a better way, I wish you could\nShow me a better way, I wish you would\nCome home today\nYou could come home today\nDear God, make me a bird\nSo I can fly far, far, far away\nDear God, make me a bird\nSo I can fly far, far, far away\nDear God, make me a bird\nSo I can fly far, far, far away\nWarm winds on a space ride (space ride)\nWhen I call your phone on a late night (late night)\nI recall your soul had a taste like (taste like)\nGardens, flowers, Warm Winds\nThe clouds below your feet\nQuit clipping on your wings\nSometimes you hate to leave somebody\nWhat's happening to we?\nWarm winds on a space ride\nWhen I call your phone on a late night\nI recall your soul had a taste like\nGardens, flowers, Warm Winds\nThe clouds below your feet\nQuit clipping on your wings\nSometimes you hate to leave somebody\nWhat's happening to we?\nWarm winds on a space ride\nSometimes I call your name out loud\nJust to make sure it's you\nSometimes I crack my veins open\nJust to see if it's blue\nYou clean me up\nThe clouds below your feet\nClean\nQuit clipping on your wings\nOur wings, yeah\nSometimes you hate to leave somebody\nYou'll see\nWhat's happening to we?\nWarm winds on a space ride\nWhen I call your phone on a late night\nI recall your soul had a taste like...\nGardens, flowers, warm winds\nThe clouds below your feet\nQuit clipping on your wings\nSometimes you hate to leave somebody\nWhat's happening to we?\nWarm winds on a space ride\nSometimes I bite my lips and close my eyes\nJust to pretend it's you\nLong live lonely thoughts on Thursday nights\nThat's when I think of you\nWe were all thirteen once (once)\nLong live tramp stamps and Pepper Ann (Pepper Ann)\nYou will never judge me for that (Uh-uh)\nYou will always love me for that (Uh-huh)\nQuit clipping on your wings\nSometimes you hate to leave somebody\nWhats happening to we?\nWarm winds on a space ride\nWhen I call your phone on a late night\nI recall your soul had taste like\nGardens, flowers\n37Embed"
  }
]
